package util;

public class KEYWORDS {

    public static final String[][] KEY_SERVICE = {
            {"엔지니어링", "건설", "기계", "설비", "전기", "전자", "정보"},
            {"설계", "건축", "전력", "소방", "종합"},
            {"연구", "원가계산", "컨설팅", "특허"},
            {"산업디자인", "환경", "조형물", "제품"},
            {"기술사사무소"},
            {"보안경비", "보안", "경비"},
            {"전기안전"},
            {"측량", "사진", "지도", "수로사업"},
            {"광고", "홍보", "옥외", "디자인", "표지판"},
            {"에너지", "에너지절약", "신재생"},
            {"폐기물", "수집", "운반"},
            {"컴퓨터", "통신", "소프트웨어", "주변기기"},
            {"문화재", "수리"},
            {"오수", "분뇨", "폐수"},
            {"운송", "해운", "화물", "운송"},
            {"전시", "이벤트", "행사", "부스"},
            {"안전", "진단", "수리", "토목", "전기"},
            {"위탁", "식당", "교육시설", "관리"},
            {"위생", "물탱크", "청소", "소독", "관리"},
            {"보험"},
            {"리스, 임대"},
            {"민간투자"},
            {"환경평가", "대기", "인구영향평가"},
            {"전문자격	세무", "회계", "법무"},
            {"파견대행번역", "파견", "교육", "번역"},
            {"감리", "건축", "기계설비", "토목", "소방", "전력", "정보시스템", "종합"},
            {"관리", "건물", "안전", "정비업", "수목", "시설물", "승강기", "소방"}
    };

    public static final String[][] KEY_GOODS = {
            {"공통자재	", "형강", "강판", "특수강", "강관", "철망", "볼트너트", "골재", "시멘트", "비철금속", "콘크리트", "목재", "가설자재", "천막", "안전시설물"},
            {"토목", "블록", "옹벽", "배수판", "빗물침투시설", "파일류", "교량", "하천", "경계석", "PE구조물", "도로시설물", "도로포장재", "발파재"},
            {"조경", "수목", "조경기기", "조경석", "잔디", "식생용재", "스프링클러", "펜스"},
            {"건축자재", "벽돌", "블록", "방수재", "석재", "타일", "지붕재", "경량콘크리트판", "미장재", "건축철물", "접착제", "도료", "창호재", "데크재", "합판", "유리", "천장재", "내외장패널", "단열재", "바닥재", "조립식건물", "이동식구조물"},
            {"급배수", "배관재", "패킹류", "배수관", "수로관", "연결구", "탱크류", "위생기재"},
            {"냉난방", "보일러", "자동제어장치", "덕트", "냉방기기", "난방기기", "건조기기", "공조기기"},
            {"기계공구", "건설기계", "중기부속품", "콘크리트장비", "원동기", "공압기기", "농업기기", "산업기계", "운반기계", "용접자재", "시험기기", "계측기기", "공구"},
            {"환경", "수질", "대기", "폐기물처리", "소음진동"},
            {"전기", "절연재료", "전력케이블", "통신용케이블", "전선관", "전력기기", "배전기기", "배전반", "조명", "전주", "교통신호"},
            {"정보통신", "컴퓨터", "컴퓨터주변기기", "방송음향기기", "네트워크장비", "소프트웨어", "전화", "통신장치"},
            {"소방안전", "소방시설", "안전보호시설"},
            {"석유화학", "유화제품", "화공약품", "합성수지", "고무제품", "연료", "가스기기", "윤활유"},
            {"사무교육", "사무용품", "사무기기", "상업용품"},
            {"생활용품", "운동", "의약품", "청소", "섬유", "일회용품", "농산물", "식료품"},
            {"조경", "조경석", "조경자재", "묘목", "화훼", "수목", "농약", "비료"},
            {"기계", "장비", "산업기계", "냉장기기", "작업공구", "중장비", "건설기계", "농축산기계"},
            {"전기", "배전반", "변압기", "전선", "자동제어", "조명"},
            {"환경", "수처리", "오염방지", "청소"},
            {"전자통신", "신호등", "안전관련", "방송기기", "소방", "보안"},
            {"식음료", "급식", "농축해산물"},
            {"운송기기	장비", "전동차", "철도", "항공", "해양조선", "승강기", "콘베이어"},
            {"의류섬유"},
            {"원자재연료", "가스", "연료", "윤활제", "화학제품", "방부"},
            {"플라스틱", "합성수지", "고무"},
            {"가구", "사무용", "가정용", "주방", "욕실", "가전제품"},
            {"전동기", "모터", "펌프", "엔진", "발전기"},
            {"군수품"},
            {"의료기기", "의약품"},
            {"레저운동"},
            {"사진영상"},
            {"인쇄", "도서", "출판", "인쇄"},
            {"사무기기"},
            {"냉난방", "공조기", "에어컨"}

    };

    public static final String[][] KEY_CONSTRUCTION = {
            {"전문건설업공사", "건설공사", "실내건축", "정비사업", "조경", "철강", "포장", "토공"},
            {"일반건설업", "건축", "산업", "토목건축"},
            {"전기통신환경", "신재생에너지", "전기공사", "정보통신", "산림사업", "대기방지", "오수처리시설동", "골재채취업"}
    };

}
