package util;

public class KEYWORDS {

    public static final String[][] KEY_SERVICE = {
            {"엔지니어링", "건설", "기계", "설비", "전기", "전자", "정보"},
            {"설계", "건축", "전력", "소방", "종합"},
            {"연구", "원가계산", "컨설팅", "특허"},
            {"산업디자인", "환경", "조형물", "제품"},
            {"기술사사무소"},
            {"보안경비", "보안", "경비"},
            {"전기안전"},
            {"측량", "사진", "지도", "수로사업"},
            {"광고", "홍보", "옥외", "디자인", "표지판"},
            {"에너지", "에너지절약", "신재생"},
            {"폐기물"}

    };

    public static final String[][] KEY_GOODS = {
            {"엔지니어링", "건설", "기계", "설비", "전기", "전자", "정보"},
            {"설계", "건축", "전력", "소방", "종합"}
    };

    public static final String[][] KEY_CONSTRUCTION = {
            {"엔지니어링", "건설", "기계", "설비", "전기", "전자", "정보"},
            {"설계", "건축", "전력", "소방", "종합"}
    };

}
